{
  "reviews": [
    {
    "name": "Dhrumil Soni",
    "review": "Investing in your learning is the most valuable decision you can make. Acquiring knowledge, skills, and experience today will pay dividends in the future.\n\nAttending the Playwright workshop with Vignesh S. was one of the best choices I’ve ever made! At first, I was sceptical about how much I could learn in just four weeks, but the experience far exceeded my expectations. Vignesh’s extensive expertise, combined with his engaging teaching style, made even the most complex automation concepts straightforward and accessible.\n\nIf you’re looking to elevate your automation skills and explore the world of JS/TS based automation with Playwright, I highly recommend enrolling in this bootcamp. \n\nIt’s an investment you won’t regret!",
    "type": "workshop",
    "subtype": "playwright",
    "title": "Senior Quality Assurance Automation Engineer",
    "company": "Tech Holding",
    "rating": 5.0,
    "photo": "dhrumil_soni.jpeg"
  },
  {
    "name": "Deepesh Agarwal",
    "review": "The Playwright workshop with TypeScript was incredibly valuable. It provided hands-on experience with automating browser tests, and using TypeScript for better code quality. The practical exercises and real-world examples helped me feel confident in applying Playwright to streamline web application testing. Vignesh, the instructor, was fantastic—he explained complex concepts clearly, provided insightful tips, and was always available to help with the questions. Highly recommend this workshop for anyone looking to improve their test automation skills!",
    "type": "workshop",
    "subtype": "playwright",
    "title": "Senior Test Engineer",
    "company": "Digital Health and Care Wales",
    "rating": 5.0,
    "photo": "deepesh_agarwal.jpeg"
  },
  {
    "name": "Venkata Lanka",
    "review": "The training program on the Playwright tool for automation is one of the best things I have attended recently, and I couldn't be more pleased with the experience. The training was comprehensive, covering all essential aspects of Playwright clearly and concisely. The instructor was knowledgeable and provided practical examples that made complex concepts easy to understand. I now feel confident in my ability to use Playwright for automation, thanks to this outstanding training. I highly recommend it to anyone looking to enhance their automation skills.",
    "type": "workshop",
    "subtype": "playwright",
    "title": "Associate Vice President",
    "company": "Deloitte",
    "rating": 5.0,
    "photo": "venkata_lanka.jpeg"
  },
  {
    "name": "Anukriti Ojha",
    "review": "The 4-week Playwright with TypeScript bootcamp led by Vignesh was an incredible learning experience. He covered a comprehensive range of topics, making it easy to grasp the essentials of this powerful UI automation tool. Playwright has redefined the UI automation experience for the testing community, and I highly recommend this session to anyone looking to start their UI automation journey or deepen their understanding of the tool",
    "type": "workshop",
    "subtype": "playwright",
    "title": "Senior Quality Engineer",
    "company": "Walmart Global Tech India",
    "rating": 4.9,
    "photo": "anukriti_ojha.jpeg"
  },
  {
    "name": "Evgeniya Turtschin",
    "review": "This Playwright Bootcamp gave me exactly what I needed — a clear, structured entry into modern test automation. Coming from Selenium + Java, I was impressed by how much easier and faster testing becomes with Playwright. Add CI/CD, Docker, and even a touch of AI — and you’ve got a real-world setup I can actually use. Big thanks to Vignesh and the team for making it all so hands-on and focused.",
    "type": "workshop",
    "subtype": "playwright",
    "title": "QA Consultant",
    "company": "ITX",
    "rating": 5.0,
    "photo": "evgeniya_turtschin.jpeg"
  },
  {
    "name": "Rakshitha C",
    "review": "The bootcamp organised by The Test Tribe and conducted by Vignesh was incredibly insightful experience. Despite the short timeframe the session was well structured. Vignesh's expertise and interactive approach kept the session engaging. A big thanks to TTT and Vignesh for organising this bootcamp! Looking forward to more such learning opportunities.",
    "type": "workshop",
    "subtype": "playwright",
    "title": "",
    "company": "",
    "rating": 5.0,
    "photo": "generic_male.jpg"
  },
  {
    "name": "Penzar Merchant",
    "review": "\"Attending Test Tribe's Playwright workshop mentored by Vignesh S. was transformative! Vignesh's expertise and engaging teaching style made complex concepts simple. I gained practical skills and confidence to excel in automated testing. Grateful for this enriching experience, highly recommend it to anyone in the testing community!\"",
    "type": "workshop",
    "subtype": "playwright",
    "title": "QA Test Analyst",
    "company": "Zurich Covermore",
    "rating": 5.0,
    "photo": "penzar_merchant.jpeg"
  },
  {
    "name": "Anukriti Ojha",
    "review": "This AI workshop on Test Automation was insightful and incredibly relevant to the future of QA. It showcased practical ways to integrate AI into testing workflows—from generating test cases to intelligent code analysis , etc. A must-attend for anyone looking to stay ahead in the evolving world of software testing and understanding our place in the new world of AI :)",
    "type": "workshop",
    "subtype": "gen-ai",
    "title": "Senior Quality Engineer",
    "company": "Walmart Global Tech India",
    "rating": 4.9,
    "photo": "anukriti_ojha.jpeg"
  },
  {
    "name": "Muralidhar Gopal",
    "review": "This workshop was very good and provided good insights to understand prompts, chatGPT, how to use it for day to day testing tasks including API and UI automation, and also got the glimpse of how to use of custom CustomGPT and cursor AI.",
    "type": "workshop",
    "subtype": "gen-ai",
    "title": "",
    "company": "",
    "rating": 4.9,
    "photo": "generic_male.jpg"
  },
  {
    "name": "Kamini Chopra",
    "review": "Vignesh is a learned trainer or educator. He knows the topic so well and had answers to all the questions, his ability to answer each question patiently makes him do justice to his job.",
    "type": "workshop",
    "subtype": "gen-ai",
    "title": "Senior Quality Assurance Specialist",
    "company": "Qualitest",
    "rating": 4.9,
    "photo": "kamini_chopra.jpeg"
  },
  {
    "name": "Titir Mishra",
    "review": "It was a great experience. Vignesh explained everything really well. I have a much better idea on how to use AI to make myself more efficient",
    "type": "workshop",
    "subtype": "gen-ai",
    "title": "QA Engineer",
    "company": "IRIS Software Group",
    "rating": 4.9,
    "photo": "titir_misra.jpeg"
  },
  {
    "name": "Omotola Ude",
    "review": "This is a great and timely course which is delivered in an engaging and understandable way. Highly relevant in today's landscape.",
    "type": "workshop",
    "subtype": "gen-ai",
    "title": "Senior Software Quality Engineer",
    "company": "Microsoft",
    "rating": 4.9,
    "photo": "omotola_ude.jpeg"
  },
  {
    "name": "Javier",
    "review": "This has been an amazing journey. It's kind of sad it came to an end. It speed up my learning and skills in a way that I couldn't expect before the bootcamp started.",
    "type": "workshop",
    "subtype": "playwright",
    "title": "QA Analyst",
    "company": "NDP Studio",
    "rating": 5.0,
    "photo": "javier.jpeg"
  },
  {
    "name": "Kalpuri Preetham",
    "review": "Vignesh's Playwright workshop completely transformed how I approach test automation. Coming from a Selenium background, I was amazed by how intuitive and powerful Playwright is. The way Vignesh broke down complex concepts like auto-waiting, network interception, and parallel execution made everything click. The hands-on exercises were perfectly structured - we built real-world scenarios that I could immediately apply at work. What impressed me most was Vignesh's depth of knowledge and his ability to answer even the trickiest questions with practical examples. This workshop didn't just teach me a tool; it changed my entire testing mindset.",
    "type": "workshop",
    "subtype": "playwright",
    "title": "SDET-1",
    "company": "Entain India",
    "rating": 4.9,
    "photo": "kalpuri_preetham.jpeg"
  },
  {
    "name": "Kapil Bhansal",
    "review": "As a freelance test automation engineer, staying ahead of the curve is crucial, and Vignesh's GenAI workshop was exactly what I needed. The way he demonstrated how to integrate AI into daily testing workflows was eye-opening. From using ChatGPT for test case generation to leveraging AI for code reviews and bug analysis - every session was packed with practical value. Vignesh doesn't just talk theory; he shows you real implementations you can use immediately. The workshop covered everything from prompt engineering to building custom GPTs for testing scenarios. This knowledge has already helped me offer more value to my clients. Highly recommend this to anyone wanting to future-proof their testing career!",
    "type": "workshop",
    "subtype": "gen-ai",
    "title": "Test Automation Engineer",
    "company": "Self Employed",
    "rating": 4.8,
    "photo": "kapil_bhansal.jpg"
  },
  {
    "name": "Swati Shinde",
    "review": "I attended both Vignesh's Playwright and GenAI workshops, and both exceeded my expectations completely. The Playwright session gave me solid technical foundations - from setup to advanced features like visual testing and API automation. But it was the GenAI workshop that truly blew my mind. Vignesh showed us how to use AI tools to generate test data, create automation scripts, and even analyze test results intelligently. His teaching style is incredible - he makes complex topics feel simple and always encourages questions. The combination of both workshops has made me much more efficient in my role. My team now sees me as the go-to person for both modern automation and AI integration in testing. Thank you, Vignesh, for such transformative learning experiences!",
    "type": "workshop",
    "subtype": "playwright",
    "title": "Deputy Manager",
    "company": "Saregama India Ltd",
    "rating": 5.0,
    "photo": "swati_shinde.jpg"
  },
  {
    "name": "Swati Shinde",
    "review": "I attended both Vignesh's Playwright and GenAI workshops, and both exceeded my expectations completely. The Playwright session gave me solid technical foundations - from setup to advanced features like visual testing and API automation. But it was the GenAI workshop that truly blew my mind. Vignesh showed us how to use AI tools to generate test data, create automation scripts, and even analyze test results intelligently. His teaching style is incredible - he makes complex topics feel simple and always encourages questions. The combination of both workshops has made me much more efficient in my role. My team now sees me as the go-to person for both modern automation and AI integration in testing. Thank you, Vignesh, for such transformative learning experiences!",
    "type": "workshop",
    "subtype": "gen-ai",
    "title": "Deputy Manager",
    "company": "Saregama India Ltd",
    "rating": 5.0,
    "photo": "swati_shinde.jpg"
  }
    ,{
      "name": "Swapnil",
      "title": "Senior QA Analyst",
      "company": "Capgemini",
      "rating": 4.8,
      "photo": "generic_male.jpg",
      "review": "I was stuck in manual QA for years. Vignesh's mentorship gave me not just a roadmap but the confidence to switch to automation. His guidance on frameworks, AI tools in QA, and resume strategy was gold. The mock interview we did helped me land my first automation role!",
      "type": "mentoring",
      "subtype": ""
    },
    {
      "name": "Shilpa Shravge",
      "title": "QA Lead",
      "company": "Absa Group",
      "rating": 4.9,
      "photo": "shilpa_shravge.jpeg",
      "review": "Vignesh's mentorship is unlike any other. He helped me migrate our legacy framework to a clean, maintainable architecture. What stood out was how he explained thread-safety and framework decisions clearly. Also loved the regular mock interviews – boosted my confidence immensely!",
      "type": "mentoring",
      "subtype": ""
    },
    {
      "name": "Neha Tyagi",
      "title": "Quality Assurance Engineer",
      "company": "Customer Alliance",
      "rating": 4.7,
      "photo": "neha_tyagi.jpeg",
      "review": "During 1:1 mentoring, Vignesh helped me transform my basic TestNG skills into a solid framework. His suggestions around reporting, retries, and cross-browser testing saved me hours of debugging. I can't thank him enough!",
      "type": "mentoring",
      "subtype": ""
    },
    {
      "name": "Sriram Balaji",
      "title": "Senior QA Developer",
      "company": "Retresco",
      "rating": 5.0,
      "photo": "sriram_balaji.jpeg",
      "review": "Through Vignesh's 1-on-1 coaching, I upgraded my entire QA strategy to include GenAI tools. We restructured our automation framework with better CI/CD, implemented Docker, and added AI-powered reporting workflows. That insight is hard to find elsewhere.",
      "type": "mentoring",
      "subtype": ""
    },
    {
      "name": "Penzar Merchant",
      "title": "QA Test Analyst",
      "company": "Zurich Covermore",
      "rating": 5.0,
      "photo": "penzar_merchant.jpeg",
      "review": "Attended Vignesh's Playwright workshop last year. It was a great learning experience and I was able to apply the learnings in my work. From then on in constant touch with Vignesh for my queries and guidance. He is a great mentor and a great teacher.",
      "type": "mentoring",
      "subtype": ""
    },
    {
      "name": "Akshaya Narayanan",
      "title": "QA Engineer",
      "company": "Check 24",
      "rating": 5.0,
      "photo": "akshaya_narayanan.jpeg",
      "review": "Couple of years back reached out to Vignesh via LinkedIn and asked him to guide me for an interview preparation. He was very helpful and guided me through the process. Throught which I have cleared my interview and got selected. Years passed and I have been in touch with Vignesh for my queries and guidance. ",
      "type": "mentoring",
      "subtype": ""
    },
    {
      "name": "Anurima Chandra",
      "title": "QA Consultant",
      "company": "JLL Technologies",
      "rating": 5.0,
      "photo": "anurima_chandra.jpeg",
      "review": "Vignesh is a great trainer and mentor. He taught me various automation techologies such as selenium, cypress etc. Due to which I could able to shine in my current organization and able to automate on my own.",
      "type": "mentoring",
      "subtype": ""
    },
    {
      "name": "Yosra Miladi",
      "title": "Software QA Team Lead",
      "company": "Insta Deep",
      "rating": 5.0,
      "photo": "generic_female.jpg",
      "review": "I've taken many online courses, but this one stood out. The Playwright course wasn't just theory – it was hands-on with Docker, Allure, Jenkins, API testing, and Cucumber! The way POM and advanced UI element handling was explained made automation fun and practical.",
      "type": "online-course",
      "subtype": "playwright"
    },
    {
      "name": "Ninad",
      "title": "SDET",
      "company": "Infosys",
      "rating": 4.9,
      "photo": "generic_male.jpg",
      "review": "Loved how this course covered everything from Cypress basics to Docker and Jenkins integration. The best part for me was learning to mock API calls and use Cypress dashboard effectively. I've implemented fixtures, custom commands, and the POM approach from this course in my daily work.",
      "type": "online-course",
      "subtype": "cypress"
    },
    {
      "name": "Divya",
      "title": "Performance Test Engineer",
      "company": "TCS",
      "rating": 4.8,
      "photo": "generic_female.jpg",
      "review": "Vignesh made Gatling approachable, even for someone new to Scala. The explanation of feeders, injections, CLI setup, and Gatling Enterprise was so clear. I now feel confident setting up performance tests with real-world scenarios. The Grafana integration module was a bonus!",
      "type": "online-course",
      "subtype": "gatling"
    },
    {
      "name": "Jaywant Chavan",
      "title": "QA Automation Engineer",
      "company": "Wipro",
      "rating": 4.9,
      "photo": "generic_male.jpg",
      "review": "From Extent Reports to Docker execution, this course is a complete Selenium framework builder's guide. I learned how to design POMs, implement retry logic, handle cross-browser testing, and even integrate with Selenium Grid. The real-world structure made it super practical!",
      "type": "online-course",
      "subtype": "selenium"
    },
    {
      "name": "Yash Swami",
      "title": "QA Automation Specialist",
      "company": "Persistent Systems",
      "rating": 4.8,
      "photo": "generic_male.jpg",
      "review": "The Playwright online course was extremely well-structured. I could follow along even with a busy schedule. The CI/CD with Jenkins, the Allure report, and JSON/CSV test data parts helped me upskill fast. Highly recommend for anyone looking to implement a full-stack testing framework.",
      "type": "online-course",
      "subtype": "playwright"
    },
    {
      "name": "Vaishali Chaudhari",
      "title": "Automation Test Engineer",
      "company": "Zensar",
      "rating": 5.0,
      "photo": "generic_female.jpg",
      "review": "This Cypress course really covers it all – from basic UI handling to mocking APIs and integrating with Docker. The examples were clear and applicable. The module on writing custom commands and using plugins was especially helpful for our project setup.",
      "type": "online-course",
      "subtype": "cypress"
    },
    {
      "name": "Jyoti Shankar Sahoo",
      "title": "Performance QA",
      "company": "Virtusa",
      "rating": 4.9,
      "photo": "generic_male.jpg",
      "review": "Clear, to the point, and packed with value. The Gatling course helped me understand feeders, scenario injection, and advanced simulation setups. I'm now able to run our API load tests independently with Grafana dashboards set up, thanks to this course.",
      "type": "online-course",
      "subtype": "gatling"
    },
    {
      "name": "Pranab Ghatak",
      "title": "QA Engineer",
      "company": "DXC Technology",
      "rating": 4.8,
      "photo": "generic_male.jpg",
      "review": "I appreciated how deep the Selenium course went into framework design – not just writing tests. Factory classes, thread-safety, exception handling, Docker execution – everything was taught like it was part of a real project. Loved the focus on best practices.",
      "type": "online-course",
      "subtype": "selenium"
    },
    {
      "name": "Surajit Paul",
      "title": "Automation Tester",
      "company": "IBM",
      "rating": 4.8,
      "photo": "generic_male.jpg",
      "review": "Brilliant course. From JSON/CSV-driven testing to Allure reports and Docker config, every topic was explained in-depth. I especially liked how debugging tips and project structuring were included – it felt like working on a real automation project.",
      "type": "online-course",
      "subtype": "playwright"
    },
    {
      "name": "Olamide John",
      "title": "QA Engineer",
      "company": "Andela",
      "rating": 5.0,
      "photo": "generic_male.jpg",
      "review": "The Cypress online course was practical, fast-paced, and comprehensive. Loved the parts where we tested XHR requests and used fixtures with custom commands. Now I can test modern UIs with confidence – and better structure!",
      "type": "online-course",
      "subtype": "cypress"
    },
    {
      "name": "Amit Malbari",
      "title": "Performance Engineer",
      "company": "LTI Mindtree",
      "rating": 4.9,
      "photo": "generic_male.jpg",
      "review": "This Gatling course breaks everything down – Scala basics, feeders, CLI usage, and even CICD flows. The Grafana integration and Gatling Enterprise module were very helpful. I now use Gatling for both regression and spike testing.",
      "type": "online-course",
      "subtype": "gatling"
    },
    {
      "name": "Sreejith",
      "title": "QA Automation Lead",
      "company": "UST Global",
      "rating": 4.9,
      "photo": "generic_male.jpg",
      "review": "If you're building a Selenium framework from scratch, this is the course to take. I was blown away by the POM chaining, retry logic, and even Docker execution with Selenium Grid. Super practical and clean code examples.",
      "type": "online-course",
      "subtype": "selenium"
    },
    {
      "name": "Prashant Appanna Savalagi",
      "title": "QA Engineer",
      "company": "TechJini",
      "rating": 4.7,
      "photo": "generic_male.jpg",
      "review": "Loved the balance of theory and real-time use cases in this Playwright course. I appreciated the way Docker, Allure, and CI/CD were added gradually. Helped me build a complete understanding and apply it in my company's setup.",
      "type": "online-course",
      "subtype": "playwright"
    },
    {
      "name": "Kesavan Selvaraj",
      "title": "Software Tester",
      "company": "Harman International",
      "rating": 4.9,
      "photo": "generic_male.jpg",
      "review": "Fantastic Cypress course. The focus on page objects, mocking APIs, and dashboard integration helped me modernize our test suite. Also, I finally understood how to use plugins the right way thanks to this course!",
      "type": "online-course",
      "subtype": "cypress"
    },
    {
      "name": "Simplice Tchoupkoua",
      "title": "QA Performance Analyst",
      "company": "Orange Cameroon",
      "rating": 4.8,
      "photo": "generic_male.jpg",
      "review": "I took this Gatling course to upskill for an enterprise project and it delivered beyond expectations. The explanation around simulation steps, feeders, command-line runs, and CICD flow was easy to follow. Truly scalable learning.",
      "type": "online-course",
      "subtype": "gatling"
    },
    {
      "name": "Ismail Savcan",
      "title": "QA Automation Specialist",
      "company": "Turkcell",
      "rating": 5.0,
      "photo": "generic_male.jpg",
      "review": "The Selenium framework course is all meat, no fluff. I learned how to structure tests using base pages, handle enums properly, and implement retry logic with Method Interceptor. It's the cleanest Selenium setup I've seen in any course.",
      "type": "online-course",
      "subtype": "selenium"
    }
  ]
}